Autodesk.Revit.DB.DirectContext3D.DrawContext.SetWorldTransform(Autodesk.Revit.DB.Transform)
Sets the world transformation that will be applied to geometry during rendering.
trf:
The transformation matrix.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.DrawContext.FlushBuffer(Autodesk.Revit.DB.DirectContext3D.VertexBuffer,System.Int32,Autodesk.Revit.DB.DirectContext3D.IndexBuffer,System.Int32,Autodesk.Revit.DB.DirectContext3D.VertexFormat,Autodesk.Revit.DB.DirectContext3D.EffectInstance,Autodesk.Revit.DB.DirectContext3D.PrimitiveType,System.Int32,System.Int32)
Submits geometry for rendering.
vertexBuffer:
The vertex buffer that contains vertex data.
vertexCount:
The number of vertices in the vertex buffer.
indexBuffer:
The index buffer that contains indices into the vertex buffer.
indexCount:
The number of indices in the index buffer.
vertexFormat:
The format of the vertices in the vertex buffer.
effectInstance:
The effect instance to be used for drawing this piece of geometry.
primitiveType:
The type of geometry primitive used in the index buffer.
start:
The first index to use for drawing.
primitiveCount:
The number of primitives to draw.
Throws Autodesk.Revit.Exceptions.ArgumentException:
A change in the graphics state has made the vertex buffer vertexBuffer invalid for rendering.
-or-
A change in the graphics state has made the index buffer indexBuffer invalid for rendering.
-or-
A change in the graphics state has made the vertex format vertexFormat invalid for rendering.
-or-
A change in the graphics state has made the effect instance effectInstance invalid for rendering.
-or-
The vertex format vertexFormat and the effect instance effectInstance do not match.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
Since:
2017